Repository: WordPressBugBounty/plugins-dsgvo-youtube
Catalog: dsgvo-youtube/languages/dsgvo-youtube-*.po
Languages: de_ch

source: This are the instruction of how to add your youtube videos safe and according to the GDPR regulations.
de_ch: Dies ist die Anleitung, wie Sie Ihre Youtube-Videos sicher und gemäss den DSGVO-Vorschriften hinzufügen.

source: Add your Videos directly (Not DSGVO / GDPR Correct)
de_ch: Videos direkt hinzufügen (Nicht DSGVO / DSGVO Korrekt)

source: With this Code you can add your Videos directly into Wordpress Pages or Posts. But be aware thats not the GDPR / dsgvo correct way
de_ch: Mit diesem Code können Sie Ihre Videos direkt in Wordpress-Seiten oder Beiträge hinzufügen. Aber seien Sie sich bewusst, dass dies nicht der DSGVO korrekten Weg ist

source: Use this Code:
de_ch: Verwenden Sie diesen Code:

source: The GDPR Correct Way to add your Video ( DSGVO / GDPR Correct)
de_ch: Die DSGVO Korrekte Art, Ihr Video hinzuzufügen ( DSGVO Korrekt)

source: Use this Code and your Video is GDPR correct in your WordPress Pages or Posts
de_ch: Verwenden Sie diesen Code und Ihr Video ist DSGVO korrekt in Ihren WordPress-Seiten oder Beiträgen

source: Create a images and add it into your wordpress library. then use the following code - but replace the url with your image url
de_ch: Erstellen Sie ein Bild und fügen Sie es Ihrer Wordpress-Bibliothek hinzu. Verwenden Sie dann den folgenden Code - aber ersetzen Sie die URL durch Ihre eigene Bild-URL

source: Overlay now resizable
de_ch: Overlay jetzt in der Grösse anpassbar

source: If you want to give your video overlay a special size, then extend the code with the heigh and width command.
de_ch: Wenn Sie Ihrem Video-Overlay eine spezielle Grösse geben möchten, erweitern Sie den Code mit dem Befehl Höhe und Breite.

source: Video replace thumbnail - no overlay (Beta)
de_ch: Video ersetzt Thumbnail - kein Overlay (Beta)

source: if you embed this new shortcode, your video is no longer loaded in an overlay
de_ch: Wenn du diesen neuen Shortcode einbettest, wird dein Video nicht mehr in ein Overlay geladen

source: after you click on the thumbnail, the image will disappear and be replaced by the video
de_ch: Nachdem Sie auf das Vorschaubild geklickt haben, verschwindet das Bild und wird durch das Video ersetzt

source: this features is under beta test - If you finde a bug, please report it here: <a href="https://wordpress.org/support/plugin/dsgvo-youtube/" target="_blank">Support</a>
de_ch: Diese Funktion befindet sich im Beta-Test - Wenn Sie einen Fehler finden, melden Sie ihn bitte hier: <a href="https://wordpress.org/support/plugin/dsgvo-youtube/" target="_blank">Support</a>

source: This is the DSGVO Youtube WordPress Plugin - created by Eric-Oliver M&auml;chler
de_ch: Dies ist das DSGVO Youtube WordPress Plugin - erstellt von Eric-Oliver Mächler
